[
  {
    "quote": "CUSEC gave me the opportunity to connect with other people and create lifelong memories that i keep close to me. no other conference has been able to spark this much passion in me when it comes to growing, both personally and career-wise, and because of that, i was able to network with people and keep that relationship past the conference. i still keep in touch with everyone on the team post conference, and i think that says a lot about CUSEC and everyone involved in making this a reality.",
    "name": "CUSEC 2026 Head Delegate"
  },
  {
    "quote": "CUSEC has been one of the most rewarding experiences of my time at university. Over two years, I've made some of my closest friends, worked on meaningful challenges, and found a community of people who are just as curious and excited about tech as I am.",
    "name": "Tyrell Haywood",
    "title": "2025 Director of Technology, 2026 Director of Speakers"
  },
  {
    "quote": "When I first joined CUSEC, I was really anxious about reaching out to professionals, I kept thinking, “I’m just a student, why would they respond?” and I was scared of rejection. Being part of the Speaker Team changed that. I learned that putting yourself out there isn’t as intimidating as it seems, and that so many people are kind and willing to say yes. CUSEC helped me grow into someone who takes initiative and isn’t afraid to start conversations that once felt impossible. What truly makes CUSEC special to me, though, is the people. At CUSEC 2024, I met two people who are now some of my best friends, and I genuinely can’t imagine my life without them. This year, I met even more amazing people, and even with such a short amount of in-person time, we grew incredibly close. Seeing everything come together and finally meeting everyone on the team was one of the best experiences I’ve had as a student, like the best kind of fever dream you never want to wake up from.",
    "name": "Sirine Tarhouni",
    "title": "2024 Head Delegate of McGill, 2026 Speakers Exec"
  },
  {
    "quote": "Being Director of Sponsorship was truly an experience I will never forget! The connections I made, the goals I accomplished, and seeing all our hard work come to life is such a wonderful feeling.",
    "name": "Angie Jocson",
    "title": "2024 Director of Speakers, 2025 Director of Sponsorships"
  },
  {
    "quote": "Prior to CUSEC, I had no experience in UI/UX design. By the end of the conference, I felt confident designing interfaces and contributing meaningfully to real projects. That growth alone made the experience unforgettable. Beyond the technical skills, CUSEC exposed me to an inspiring environment filled with ambitious, growth driven individuals. I connected with talented students and professionals from across Canada, each bringing expertise from different fields. The conversations, shared ideas, and late night discussions were just as valuable as the sessions themselves. I walked away not only with knowledge, but with lasting friendships and a stronger professional network. Overall, I highly recommend CUSEC to anyone looking to grow, challenge themselves, and connect with passionate individuals. It is more than just a conference. It is a space where you can learn, build, and become part of a driven community.",
    "name": "Angel Shinh",
    "title": "2026 Director of UI/UX"
  },
  {
    "quote": "Serving as Director of Technology for CUSEC 2026 was one of the most rewarding experiences of my developer journey as a student. Building and shipping a production platform with the organizing team spread across the country meant I had to balance development with real-world constraints such as deadlines, cross-team coordination, and unexpected traffic during the conference. From turning a simple meeting idea into a full-scale Scavenger Hunt feature with extensive Admin panels, to deploying fixes live at the conference, every challenge became a lesson. I genuinely believe that CUSEC has helped me grow, both as a developer and as a collaborator.",
    "name": "Shrey Bhatt",
    "title": "2025 Head Delegate of Seneca College, 2026 Director of Technology"
  },
  {
    "quote": "CUSEC is the place where you find your community in tech, people who challenge you and lift you up. I think it is incredibly special and rare to meet so many people you connect with, but CUSEC makes that possible. We spend one year together, separated across provinces but with the same goal: to organize a national conference.The fulfillment of being able to see the results of our hard work in January, whether in the form of delegates having hour-long discussions with speakers or students teaming up to solve our scavenger hunt riddles, makes the year-long effort so worth it!",
    "name": "Janelle Tam",
    "title": "2025 Speakers Exec, 2026 Director of Events, 2027 Co-Chair"
  },
  {
    "quote": "Being on CUSEC for 2 years now (starting as a Head Delegate to joining recently as a Logistics Exec), my experiences from 2025 and 2026 were vastly different. However, what has stayed the same and is why I keep coming back (2027 fingers crossed) are the people on the team. Planning an event isn't easy, but when you are surrounded by highly motivated, passionate, and overall cool people who want to make to give back to others, idk if it makes the work easier but it certainly makes it fun. There is no experience that is as rewarding as CUSEC and I highly encourage you apply :) (who knows you might also get a role named after you)",
    "name": "Franklin Ramirez",
    "title": "2025 Head Delegate of University of Waterloo, 2026 Logistics Exec, 2027 Director of Franklin"
  },
  {
    "quote": "My time as Director of Events taught me a tremendous amount, and many of those lessons still stay with me today. The people I met while organizing events across the City of Montreal have remained valuable connections, even years later. It was an incredibly rewarding experience, both personally and professionally. I couldn't recommend it more.",
    "name": "TJ Klint",
    "title": "2023 Delegate, 2024 Head Delegate & Director of Events, 2025 Co-Chair"
  },
  {
    "quote": "Designing for CUSEC is so much fun, and a great learning opportunity. You get to work with nearly every team and play a key role in shaping the conference’s image for the year. Don’t worry if you’ve never designed anything, because my first experience with design tools actually started at CUSEC! You’ll gain experience designing everything from posters, to social media graphics, to logos, to merch, and there is no better feeling than seeing all that hard work come to fruition and seeing it on display. I truly recommend this role for anyone looking to try their hand at design!",
    "name": "Taryn Beaupre",
    "title": "2025 Director of Promotions x Tech Design, 2026 Director of Design"
  },
  {
    "quote": "A lot goes into CUSEC from start to finish, serving as the Director of Logistics I got to see myself how these large-scale events work. \nYou’re in the middle of everything, working across all teams, putting out fires, solving conflicts and issues where the stakes are high. Once CUSEC actually came around, seeing hundreds of people from across Canada come in and enjoy the event we put together was one of the most rewarding experiences I’ve had.\n\nIf you want to be apart of something cool and work with great people who push you to grow, <b>definitely</b> consider applying.",
    "name": "Carson Spriggs",
    "title": "2025 Head Delegate of Montreal & Sponsors Exec, 2026 Director of Logistics, 2027 Co-Chair"
  }
]
